#+title:      B Klasse 2020-24
#+date:       [2022-12-30 Fr 19:37]
#+filetags:   :4b:Project:
#+identifier: 20221230T193718
#+STARTUP: showall
#+STARTUP: logdone
#+STARTUP: lognotedone
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/4b.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 4B [KV Erwin Essl]

#+Name: 2021-students
| First      | Last         | Name                  | Note | Mitarbeit | Heft | LZK |
|------------+--------------+-----------------------+------+-----------+------+-----|
| Maximilian | Fischhofer   | [[Maximilian Fischhofer][Maximilian Fischhofer]] |    2 |         2 |    2 |     |
| Hannah     | Höllbacher   | [[Hannah Höllbacher][Hannah Höllbacher]]     |    1 |         1 |    1 |     |
| Leon       | Keser        | [[Leon Keser][Leon Keser]]            |    3 |         3 |    3 |     |
| Thomas     | Krallinger   | [[Thomas Krallinger][Thomas Krallinger]]     |    1 |         1 |    1 |     |
| Fabian     | Lienbacher   | [[Fabian Lienbacher][Fabian Lienbacher]]     |    2 |         2 |    2 |     |
| Lena       | Malter       | [[Lena Malter][Lena Malter]]           |    1 |         1 |    1 |     |
| Sophia     | Mayr         | [[Sophia Mayr][Sophia Mayr]]           |    1 |         1 |    1 |     |
| Florian    | Peroutka     | [[Florian Peroutka][Florian Peroutka]]      |    1 |         1 |    1 |     |
| Andreas    | Rußegger     | [[Andreas Rußegger][Andreas Rußegger]]      |    2 |         2 |    2 |     |
| Valerie    | Schönauer    | [[Valerie Schönauer][Valerie Schönauer]]     |    1 |         1 |    1 |     |
| Marlene    | Seidl        | [[Marlene Seidl][Marlene Seidl]]         |    1 |         1 |    1 |     |
| Anna       | Spitzelseder | [[Anna Spitzelseder][Anna Spitzelseder]]     |    1 |         1 |    1 |     |
| Florian    | Steiner      | [[Florian Steiner][Florian Steiner]]       |    1 |         1 |    1 |     |
| Karin      | Struber      | [[Karin Struber][Karin Struber]]         |    1 |         1 |    1 |     |
| Lukas      | Wagenhofer   | [[Lukas Wagenhofer][Lukas Wagenhofer]]      |    2 |         2 |    2 |     |
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: ' + first + '' + last + '')
      print('|-------+-------+------+---------|')
      print('| Datum | Topic | Note | Notizen |')
      print('|-------+-------+------+---------|')
      print('\n')
      print('*** Note ' + first + ' ' + last + '')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
* Mitarbeittabelle
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                  | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|-----------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Maximilian Fischhofer][Maximilian Fischhofer]] |    2 | 2 | 2 | 3 | 2 | 3 | 2 | 3 | 3 | 2 |  3 |
| [[Hannah Höllbacher][Hannah Höllbacher]]     |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Leon Keser][Leon Keser]]            |    3 | 3 | 3 | 3 | 2 | 3 | 2 | 2 | 2 | 3 |  3 |
| [[Thomas Krallinger][Thomas Krallinger]]     |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Fabian Lienbacher][Fabian Lienbacher]]     |    2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 |  2 |
| [[Lena Malter][Lena Malter]]           |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Sophia Mayr][Sophia Mayr]]           |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Florian Peroutka][Florian Peroutka]]      |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Andreas Rußegger][Andreas Rußegger]]      |    2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 |  2 |
| [[Valerie Schönauer][Valerie Schönauer]]     |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Marlene Seidl][Marlene Seidl]]         |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Anna Spitzelseder][Anna Spitzelseder]]     |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Florian Steiner][Florian Steiner]]       |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Karin Struber][Karin Struber]]         |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Lukas Wagenhofer][Lukas Wagenhofer]]      |    2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 | 2 |  2 |
#+TBLFM: $2=vmean($3..$>);%.0f
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

